In [44]:
import seaborn as sns
print(sns.__version__)

0.13.2

In [60]:
import pandas as pd

# Load dataset
df = pd.read_csv(r"titanic_dataset/train.csv")

In [61]:
# Preview data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
print("Shape = ",df.shape)
df.info()

Shape =  (891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [63]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [64]:
# Data Cleaning

#droping unrelavent columns

df.drop(columns=["PassengerId", "Cabin", "Ticket"], inplace=True)

In [65]:
print(df.columns)

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [66]:
#handling missing values

#check most frequent value for Embarked
df["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [67]:
#filled missing values with most frequent Category , Here S
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])

In [68]:
df["Embarked"].value_counts()

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [71]:
#calculating mean for Age
df["Age"].median()

28.0

In [72]:
# replacing missing values of Age by its median (avg can be affected by outliers)
df["Age"] = df["Age"].fillna(df["Age"].median())

In [74]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
#Encoding Categorical Features (Sex and Embarked)

In [76]:
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [79]:
#using map for encoding Sex column which have Binary values(male and female)
#other option is One Hot Enconding , first it will create two column and then will drop
#one of then, it is like extra work..

df["Sex"] = df["Sex"].map({"male": 0, "female": 1})

In [80]:
print(df.Sex)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [81]:
#To encode Embarked which has three value , I am using OHE(one hot encding)

#Create 2 columns: Embarked_Q, Embarked_S
#Drop Embarked_C (to avoid redundancy)

df = pd.get_dummies(df, columns=["Embarked"], drop_first=True)

In [84]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,7.2500,False,True
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,71.2833,False,False
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,7.9250,False,True
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,53.1000,False,True
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,8.0500,False,True

In [85]:
df.to_csv("titanic_dataset/cleaned_train.csv", index=False)

In [ ]:
#Further Preprocessing Can Be Model-Specific